{
  "accessibility-information-preserved-partially-description": "",
  "accessible-components-available-partially-description": "",
  "accessible-content-production-possible-partially-description": "",
  "accessible-templates-available-partially-description": "",
  "alt-available-partially-description": "Most functional and informative images and graphics throughout the control panel implement text alternatives; this includes graphics like entry status indicators, field modification indicators, and other non-text UI elements. However, for hierarchical elements like categories, the visual style indicating nesting level does not have a text alternative; a fix has been implemented for version 4.5.\r\n\r\nSome author-uploaded assets, like images, use author-provided alternative text when Craft CMS's default Alternative Text field has been added to the field layout. As of version 4.4, video previews also include adjacent transcripts when the Alternative Text field is populated.",
  "alternatives-manageable-partially-description": "",
  "auto-content-accessible-partially-description": "Craft CMS makes no assumptions about the site's front-end markup, and developers have full control over all templates and markup. Likewise, layouts and fields are fully customizable by developers, although Craft gives developers the tools to produce accessible field layouts.\r\n\r\nFor example, Craft CMS provides some accessibility-related default field types, like Alternative Text; however, the onus is on developers to add it to the field layout for images and videos, and to mark the field as required.",
  "automatically-checks-partially-description": "",
  "comments": "",
  "content-searchable-partially-description": "Craft CMS does not have a custom feature for searching text on authoring screens. While an author can activate in-browser search to search editable text, the search is not limited to the focused field.\r\n\r\nWhile the in-browser search is usually sufficient for finding text in editable fields, there are a couple outstanding issues. The in-browser search also finds invisible and off-screen content, so the visible Search focus may be lost. In addition, content may be separated into various tabs in the field layout; browser search is unable to find editable content in inactive tabs.",
  "documentation-promotes-accessibility-partially-description": "",
  "editors-guided-partially-description": "Craft CMS has few default field types, and the editor experience is almost completely customizable by the developers building the site. Because developers have almost complete control over field layouts, it's possible to enhance editing screens - via custom fields, instructions, tips, and warnings - to create an authoring experience that prioritizes and guides accessible content production.",
  "enough-time-partially-description": "The user session duration is an hour by default; this duration can be shortened or lengthened by the site developer. Before the session times out, a modal dialog warns the user that the session is about to expire, and the user can choose to extend the session.\r\n\r\nBy default, notifications are only shown for 5 seconds before they disappear automatically. However, users can increase this duration to 10 seconds - or have them shown indefinitely, with the option to close - by updating the Notification Duration preference in their account settings.",
  "features-documented-partially-description": "",
  "features-promote-accessibility-partially-description": "",
  "flashing-optional-partially-description": "Videos only autoplay when a user enables the video preview modal in the control panel; these video players have a pause button. However, user-uploaded GIF and animated WebP files currently autoplay on various screens. A new user preference setting is in progress to disable autoplay for time-based media and is planned for the 4.5 release.",
  "form_name": "submission",
  "form_version": "1",
  "helps-fix-problems-partially-description": "",
  "navigate-by-structure-partially-description": "",
  "non-web-based-accessible-partially-description": "",
  "presentation-programmatically-determined-partially-description": "",
  "prevent-mistakes-partially-description": "Developers can enable versioning for entry elements; this lets content authors view and restore entries from previous versions. However, assets, categories, tags, and third-party element types do not support versioning.\r\n\r\nBy default, when authors start editing an entry, the CMS creates a new draft and autosaves changes. If the author wants to revert to the most recent version at any time, a UI control allows the author to discard unsaved changes easily.\r\n\r\nAuthors can update and reverse changes to user interface settings from the Account page.",
  "previews-accessible-partially-description": "",
  "question-accessibility-information-preserved": "not applicable",
  "question-accessible-components-available": "no",
  "question-accessible-content-production-possible": "yes",
  "question-accessible-templates-available": "not applicable",
  "question-alt-available": "partially",
  "question-alternatives-manageable": "yes",
  "question-auto-content-accessible": "partially",
  "question-automatically-checks": "no",
  "question-content-searchable": "partially",
  "question-documentation-promotes-accessibility": "no",
  "question-editors-guided": "partially",
  "question-enough-time": "partially",
  "question-features-documented": "no",
  "question-features-promote-accessibility": "no",
  "question-flashing-optional": "partially",
  "question-helps-fix-problems": "no",
  "question-navigate-by-structure": "yes",
  "question-non-web-based-accessible": "not applicable",
  "question-presentation-programmatically-determined": "yes",
  "question-prevent-mistakes": "partially",
  "question-previews-accessible": "yes",
  "question-supports-display-prefs": "not sure",
  "question-web-based-accessible": "partially",
  "question-works-with-keyboard": "partially",
  "repository": "wai-authoring-tools-list",
  "submission_date": "2023-04-06T18:05:05.662Z",
  "submission_ref": "8f43a1e0-d4a5-11ed-81a4-cd322f47865b",
  "submitter-email": "accessibility@craftcms.com",
  "submitter-name": "Lupe Camacho",
  "supports-display-prefs-partially-description": "",
  "tool-description": "Craft is a flexible, user-friendly CMS for creating custom digital experiences on the web and beyond.",
  "tool-license": "limited-free",
  "tool-link": "https://craftcms.com/",
  "tool-name": "Craft CMS",
  "tool-release-date": "2023-04-04",
  "tool-statement": "https://craftcms.com/accessibility/report",
  "tool-vendor": "Pixel & Tonic, Inc.",
  "tool-version": "4.4.6.1",
  "web-based-accessible-partially-description": "We audited the Craft CMS authoring experience against WCAG 2.1 AA in version 4.0.0, and we've published the results in our Accessibility Conformance Report. As of the most recent stable release, our team has resolved over 60% of the reported issues; we plan to fix all reported issues by version 5.0.",
  "works-with-keyboard-partially-description": "No keyboard traps exist, but as of the current release, authors can't complete some functions without the use of a mouse. Keyboard-inaccessible functions include reordering table rows, reordering widgets on the Dashboard page, editing image focal points, and image cropping."
}
